unload/cf/Documents/ВСД2_ОбъединениеПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ВСД2_ОбъединениеПартий</Name>
			<Comment>api 2.*</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Владелец_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_applicationID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция_Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПродукции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияПрисоединения</Name>
					<Comment>Присоединение / Объединение</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаЗапрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Можно фасовку добавить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>удалить_Запросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

unload/cf/Catalogs/ВСД_Продукция_Элемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ВСД_Продукция_Элемент</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетГОСТу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТермическиеУсловияПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_ТермическиеУсловияПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФасовкаФормаУпаковки</Name>
					<Comment>Тип упаковки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФасовкаКоличество</Name>
					<Comment>Количество единиц упаковки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФасовкаОбъем</Name>
					<Comment>Объем единицы упаковки товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФасовкаЕдиницаИзмерения</Name>
					<Comment>Единица измерения объёма единицы упаковки товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скоропортящийся</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

unload/cf/Documents/ВСД2_ОбъединениеПартий/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область НемодальныеОкна
&НаКлиенте
Процедура ПредупреждениеПользователю(ТекстПредупреждения) Экспорт
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", ЭтаФорма);	
    ПоказатьПредупреждение( Оповещение,   ТекстПредупреждения,   0,   "Предупреждение" );
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияПредупреждения(Параметры) Экспорт	
КонецПроцедуры

#КонецОбласти

//После заполнения сюда сразу попадаем
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда //ЭтоНовый   https://helpf.pro/faq83/view/1829.html
		
	КонецЕсли;
	Если Объект.Номер = "" Тогда  // тоже новый
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СписокПараметров = кб99_ВСД.ЗагрузитьПараметры( Объект.Организация );
	Объект.Владелец_ХозСубъект = СписокПараметров["Отправитель_ХозСубъект"];
	Объект.Владелец_Площадка = СписокПараметров["Отправитель_Площадка"];
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.Статус = "";
		ЭтаФорма.ApplicationID = "";
		ЭтаФорма.Запросы.Очистить();
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
       		Объект.Организация   =  кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();
			ОрганизацияПриИзменении("");
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтаФорма.СтатусЗапроса) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
	ЭлементОтбора = ЭтаФорма.дсЗапросы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		
	ОбновитьНадписи(ЭтаФорма);
	
КонецПроцедуры
//********************
//&НаКлиенте
//Процедура ВыбратьПлощадкиПоХС(Элемент, ГУИДХСдляОтбора)
//	ГУИДХСдляОтбора = ?(ЗначениеЗаполнено(ГУИДХСдляОтбора),ГУИДХСдляОтбора,"****");
//	ЗначениеОтбора = Новый Структура("GuidХозСубъекта", ГУИДХСдляОтбора);
//	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора,Отбор", Истина, Истина,ЗначениеОтбора);	
//	ОткрытьФорму("Справочник.ВСД_Площадка.ФормаВыбора", ПараметрыПодбора, Элемент);	
//КонецПроцедуры

&НаКлиенте
Функция СтруктураОтбораПартий()
	//СтруктураОтбора = ВСД_Общий.СтруктураОтбораПартий( Неопределено , Объект.Отправитель_Площадка, Объект.Отправитель_ХозСубъект);
	//ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, Отбор", Истина, Истина, Истина, СтруктураОтбора);	
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Получатель_Площадка", Объект.Владелец_Площадка );
	СтруктураОтбора.Вставить("Получатель_ХозСубъект", Объект.Владелец_ХозСубъект );
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь );
	Если ЗначениеЗаполнено(Объект.ВидПродукции) Тогда 
		СтруктураОтбора.Вставить("ВидПродукции", Объект.ВидПродукции );
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Продукция_Элемент) Тогда 
		СтруктураОтбора.Вставить("Продукция_Элемент", Объект.Продукция_Элемент );	
	КонецЕсли;	
	Возврат СтруктураОтбора;
КонецФункции

//&НаСервере
//Функция ВыборПартийФильтрЛокал( ВыбВидПродукции = "", ВСД_Продукция_Элемент="",ВСД_Площадка="", ВСД_ХозСубъект="")
//     Запрос = Новый Запрос;
//	 ТекстЗапроса =         
//         "ВЫБРАТЬ
//         |    ВСДПартия.Ссылка
//         |ИЗ
//         |    Справочник.ВСД_Партия КАК ВСДПартия
//         |ГДЕ
//         |    ВСДПартия.ПометкаУдаления = ЛОЖЬ
//		 |    И ВСДПартия.Количество > 0";
//	 Если ЗначениеЗаполнено(ВСД_Продукция_Элемент) Тогда
//		 ТекстЗапроса = ТекстЗапроса + "		 
//         |    И ВСДПартия.Продукция_Элемент = &ВыбПродукция_Элемент";
//	 КонецЕсли;
//	 Если ЗначениеЗаполнено(ВСД_Площадка) Тогда
//		 ТекстЗапроса = ТекстЗапроса + "		 
//         |    И ВСДПартия.Получатель_Площадка = &ВыбПлощадка";
//	 КонецЕсли;
//	 Если ЗначениеЗаполнено(ВСД_ХозСубъект) Тогда
//		 ТекстЗапроса = ТекстЗапроса + "		 
//         |    И ВСДПартия.Получатель_ХозСубъект.GUID = &ВыбХС";
//	 КонецЕсли;
//	Если ЗначениеЗаполнено(ВыбВидПродукции) Тогда
//			ТекстЗапроса = ТекстЗапроса + " 	
//			|	И ВСДПартия.Продукция_Элемент.ВидПродукции = &ВыбВидПродукции";			
//	КонецЕсли;
//	 
//	 
// 	Запрос.Текст = ТекстЗапроса;
//    Запрос.УстановитьПараметр("ВыбПлощадка", ВСД_Площадка);
//    Запрос.УстановитьПараметр("ВыбПродукция_Элемент",ВСД_Продукция_Элемент);
//	Запрос.УстановитьПараметр("ВыбВидПродукции" , ВыбВидПродукции);
//	Запрос.УстановитьПараметр("ВыбХС", ВСД_ХозСубъект.GUID);
//    СписокЭлементов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
//    СЗЭлементов = Новый СписокЗначений;
//    СЗЭлементов.ЗагрузитьЗначения(СписокЭлементов);
//	Возврат СЗЭлементов;
//КонецФункции

// *******************Шапка
&НаКлиенте
Процедура Владелец_ХозСубъектПриИзменении(Элемент)
	Объект.Владелец_Площадка = "";
КонецПроцедуры

&НаКлиенте
Процедура Владелец_ПлощадкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//// Отбор по ХС включим
	//ГУИДХСдляОтбора = ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(Объект.Владелец_ХозСубъект,"GUID");
	//ВыбратьПлощадкиПоХС(Элемент,ГУИДХСдляОтбора);
	
	ЗначениеОтбора = Новый Структура("ХозСубъект", Объект.Владелец_ХозСубъект);
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора,Отбор", Истина, Истина,ЗначениеОтбора);	
	ОткрытьФорму("Справочник.ВСД_Площадка.ФормаВыбора", ПараметрыПодбора, Элемент);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыЭлемента(ВыбЭлемент)
	Рез = Новый Структура;
	Рез.Вставить("Продукция",ВыбЭлемент.Продукция);
	Рез.Вставить("ВидПродукции",ВыбЭлемент.ВидПродукции);
	Рез.Вставить("Наименование",ВыбЭлемент.Наименование);
	Рез.Вставить("ЕдиницаИзмерения",ВыбЭлемент.ЕдиницаИзмерения);
	Рез.Вставить("СрокГодности",ВыбЭлемент.СрокГодности);
	Возврат Рез;
КонецФункции

//******* ТЧ
&НаСервере
Функция ПолучитьРеквизитыПартии(ВыбЭлемент)
	Рез = Новый Структура;
	Рез.Вставить("Продукция",ВыбЭлемент.Продукция);
	Рез.Вставить("ВидПродукции",ВыбЭлемент.ВидПродукции);
	Рез.Вставить("Продукция_Элемент",ВыбЭлемент.Продукция_Элемент);
	Рез.Вставить("Наименование",ВыбЭлемент.Наименование);
	Рез.Вставить("ЕдиницаИзмерения",ВыбЭлемент.ЕдиницаИзмерения);
	Рез.Вставить("Количество",ВыбЭлемент.Количество);
	Рез.Вставить("ДатаСрокГодности1",ВыбЭлемент.ДатаСрокГодности1);
	Рез.Вставить("ДатаИзготовления1",ВыбЭлемент.ДатаИзготовления1);
	Рез.Вставить("ДатаСрокГодности2",ВыбЭлемент.ДатаСрокГодности2);
	Рез.Вставить("ДатаИзготовления2",ВыбЭлемент.ДатаИзготовления2);
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьРеквизитыШапки( ДанныеПартии )
	Если НЕ ЗначениеЗаполнено(Объект.Продукция_Элемент) Тогда
		Объект.Продукция_Элемент = ДанныеПартии.Продукция_Элемент;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВыбПродукция) Тогда
		Объект.ВыбПродукция = ДанныеПартии.Продукция;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
		Объект.ВидПродукции = ДанныеПартии.ВидПродукции;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПродукции) Тогда
		Объект.НаименованиеПродукции = ДанныеПартии.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыСтрокиПродукция(СтрокаТЧ,ЧтоИзменили)
	Если ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
		ДанныеПартии = ПолучитьРеквизитыПартии(СтрокаТЧ.Партия);
		СтрокаТЧ.Количество = ДанныеПартии.Количество;	
		СтрокаТЧ.ЕдиницаИзмерения =ДанныеПартии.ЕдиницаИзмерения;
		СтрокаТЧ.ДатаИзготовления1 =ДанныеПартии.ДатаИзготовления1;
		СтрокаТЧ.ДатаИзготовления2 =ДанныеПартии.ДатаИзготовления2;
		СтрокаТЧ.ДатаСрокГодности1 =ДанныеПартии.ДатаСрокГодности1;
		СтрокаТЧ.ДатаСрокГодности2 =ДанныеПартии.ДатаСрокГодности2;		
		
		ЗаполнитьРеквизитыШапки( ДанныеПартии );
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элемент.Родитель.ТекущиеДанные;
//	СтрокаТабличнойЧасти.Партия = ВСД.ВыбратьПартию(СтрокаТабличнойЧасти.Продукция_Элемент, Объект.Владелец_Площадка, Объект.Владелец_ХозСубъект);
//	ЗаполнитьРеквизитыСтрокиПродукция(СтрокаТабличнойЧасти,Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
//	Если НЕ ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
//		Предупреждение("Не указан Вид Продукции !!!");
////		ЭтаФорма.ТекущийЭлемент = ЭлементыФормы["ВидПродукции"];
//		Возврат;
//	КонецЕсли;
	//ВремПродЭлемент = Объект.Продукция_Элемент;
	//Если ФлПодбиратьБезУчетаПродукцияЭлемент Тогда
	//	ВремПродЭлемент = "";	
	//КонецЕсли;
	//СписокПартийДляВыбора = ВыборПартийФильтрЛокал( Объект.ВидПродукции, ВремПродЭлемент,Объект.Владелец_Площадка, Объект.Владелец_ХозСубъект);
	////СписокПартийДляВыбора = ВСД.СписокАктуальныхПартийПоФильтру_Запрос(Объект.Продукция_Элемент,Объект.Владелец_Площадка, Объект.Владелец_ХозСубъект);	
	//ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора,Отбор", Истина, Истина,Новый Структура("Ссылка", СписокПартийДляВыбора));	
	
	СтруктураОтбора = СтруктураОтбораПартий();	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора,МножественныйВыбор,Отбор", Истина, Истина, Истина, СтруктураОтбора);	
	
	ОткрытьФорму("Справочник.ВСД_Партия.ФормаВыбора", ПараметрыПодбора, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПартияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элемент.Родитель.ТекущиеДанные;
	ЗаполнитьРеквизитыСтрокиПродукция(СтрокаТабличнойЧасти,Элемент);
КонецПроцедуры

//************* Шапка Продукция
&НаКлиенте
Процедура ВыбПродукцияПриИзменении(Элемент)
	 Объект.ВидПродукции = "";
	 Объект.Продукция_Элемент = "";
	 Объект.НаименованиеПродукции = "";
	 Объект.Продукция.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	 Объект.Продукция_Элемент = "";
	 Объект.НаименованиеПродукции = "";
	 Объект.Продукция.Очистить();
КонецПроцедуры

&НаСервере
Процедура Продукция_ЭлементПриИзмененииСервер()
	Объект.ВидПродукции = Объект.Продукция_Элемент.ВидПродукции;
	Объект.ВыбПродукция = Объект.Продукция_Элемент.Продукция;
	Объект.НаименованиеПродукции = Объект.Продукция_Элемент.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура Продукция_ЭлементПриИзменении(Элемент)
	Продукция_ЭлементПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура Продукция_ЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора,Отбор", Истина, Истина,Новый Структура("ВидПродукции", Объект.ВидПродукции));	
	ОткрытьФорму("Справочник.ВСД_Продукция_Элемент.ФормаВыбора", ПараметрыПодбора, Элемент);		
КонецПроцедуры

//Подбор
&НаСервере
Процедура ЗаполнитьРеквизитыСтрокиПродукцияСервер(СтрокаТЧ)
	Если ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
//		СтрокаТЧ.Продукция_Элемент = СтрокаТЧ.Партия.Продукция_Элемент;
//		СтрокаТЧ.Продукция = СтрокаТЧ.Партия.Продукция ;
//		СтрокаТЧ.ВидПродукции =  СтрокаТЧ.Партия.ВидПродукции;
//		СтрокаТЧ.НаименованиеПродукции =  СтрокаТЧ.Партия.Наименование;
		СтрокаТЧ.ЕдиницаИзмерения =СтрокаТЧ.Партия.ЕдиницаИзмерения;
		СтрокаТЧ.Количество = СтрокаТЧ.Партия.Количество;
		СтрокаТЧ.ДатаИзготовления1 =СтрокаТЧ.Партия.ДатаИзготовления1;
		СтрокаТЧ.ДатаИзготовления2 =СтрокаТЧ.Партия.ДатаИзготовления2;
		СтрокаТЧ.ДатаСрокГодности1 =СтрокаТЧ.Партия.ДатаСрокГодности1;
		СтрокаТЧ.ДатаСрокГодности2 =СтрокаТЧ.Партия.ДатаСрокГодности2;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнПодбор(Команда)
//	Если НЕ ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
////		ПредупреждениеПользователю("Не указан Вид Продукции !!!");
////		ЭтаФорма.ТекущийЭлемент = ЭлементыФормы["ВидПродукции"];
//		Возврат;
//	КонецЕсли;
	//ВремПродЭлемент = Объект.Продукция_Элемент;
	//Если ФлПодбиратьБезУчетаПродукцияЭлемент Тогда
	//	ВремПродЭлемент = "";	
	//КонецЕсли;
	//СписокПартийДляВыбора = ВыборПартийФильтрЛокал( Объект.ВидПродукции, ВремПродЭлемент,Объект.Владелец_Площадка, Объект.Владелец_ХозСубъект);
	//ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора,МножественныйВыбор,Отбор", Истина, Истина, Истина,Новый Структура("Ссылка", СписокПартийДляВыбора));	
	
	СтруктураОтбора = СтруктураОтбораПартий();	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора,МножественныйВыбор,Отбор", Истина, Истина, Истина, СтруктураОтбора );	

	ОткрытьФорму("Справочник.ВСД_Партия.ФормаВыбора", ПараметрыПодбора,Этаформа.Элементы.Продукция);	
КонецПроцедуры

&НаСервере
Процедура ПродукцияОбработкаВыбораНаСервере(ВыбранноеЗначение)
    Для Каждого вЗнч Из ВыбранноеЗначение Цикл
        Если объект.продукция.НайтиСтроки(Новый Структура("Партия", вЗнч)).Количество() = 0 Тогда
           нСтр = объект.продукция.Добавить();
           нСтр.Партия = вЗнч.Ссылка;
           ЗаполнитьРеквизитыСтрокиПродукцияСервер(нСтр);
		   
			Если НЕ ЗначениеЗаполнено(Объект.ВыбПродукция) Тогда 
				Объект.ВыбПродукция = вЗнч.Ссылка.Продукция;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ВидПродукции) Тогда 
				Объект.ВидПродукции = вЗнч.Ссылка.ВидПродукции;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.Продукция_Элемент) Тогда 
				Объект.Продукция_Элемент = вЗнч.Ссылка.Продукция_Элемент;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПродукции) Тогда 
				Объект.НаименованиеПродукции = вЗнч.Ссылка.Наименование;
			КонецЕсли;
        КонецЕсли;
     КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПродукцияОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура кнОткрытьЗапрос(Команда)
	ПутьКXML = "";
	Если (ЭтаФорма.Элементы.Запросы.ТекущаяСтрока <> Неопределено) Тогда
		ПутьКXML = ЭтаФорма.Элементы.Запросы.ТекущиеДанные.Файл;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКXML) Тогда
		//КомандаСистемы("""""%ProgramFiles%\Internet Explorer\iexplore.exe"""" "+ПутьКXML);
		ЗапуститьПриложение(ПутьКXML);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписи(Форма)
	
	Объект = Форма.Объект;
	
	Запрос = кб99_ВСД_Общий.НайтиПоследнийЗапрос( Объект.Ссылка );
	Форма.ApplicationID = Запрос.ApplicationID;
	Форма.СтатусЗапроса = Запрос.СтатусЗапроса;
	Если ЗначениеЗаполнено( Запрос.Ошибки ) Тогда
		Форма.Элементы.Ошибки.Видимость = Истина;
		Форма.Ошибки = Запрос.Ошибки;
	Иначе
		Форма.Элементы.Ошибки.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
